[
    {
        "title": "From Liam Payne to Crowdstrike, here are the top trending searches of 2024, according to Google",
        "link": "https://techcrunch.com/2024/12/10/from-liam-payne-to-coastal-granddaughters-here-are-the-top-trending-searches-for-2024-according-to-google/",
        "content": "Interest in Donald Trump surged higher than interest in Kamala Harris. People ate up content on Dubai chocolate bars. And the Yankees really did win. These and more insights are all from Google’s annual list of toptrending searches, which it released today. Google’s place in popular culture today is undisputed. It’s thebiggest internet property in the world, and Google Search themost visitedsite. Yes, the rise ofGenerative AI chatbotsandsocial appsmay, one day, eat into Google’s dominance, but for now, it reigns supreme, and these results serve as a barometer of what the world is curious about at the moment. We’ll go through some of the results below, but first, let’s dwell a little more on what Google is measuring. First of all, these arenotthe most popular search terms for 2024. Google tells me that if it built that list, the most popular searches would be for words like “weather,” and they don’t really change over the years. “Year in Search” instead takes note of what surged in popularity in 2024, specifically which queries “had a high spike in traffic over a sustained period in 2024 as compared to 2023.” The aim is to sift out perennial favourites like “weather” to identify what people were curious about this past year. Google told TechCrunch the list is put together just from text-based searches ongoogle.com. It doesn’t include searches on other Google properties like YouTube, or queries passed through its Gemini generative AI chatbot. The one exception to all that is a list of trending “hum” searches, the tool which lets you hum a tune to figure out what it actually is. You have to wonder how these lists will look in future years if current trends hold. Recent research (viaeMarketer) found that in the U.S., younger adults have turned away from using Google for online searches, with Gen Z 25% less likely to use it compared to Gen X. Instead, they favour social media sites like TikTok to discover trends, news and answers to questions they may have. That might spur Google to include more data over time from YouTube, which still holds strong with those younger demographics. The rise of Generative AI is also a factor. So far, OpenAI’s ChatGPT seems to be the only bot to have broken into the top 10 list of most popular websites in the world according toSimilarWeb. Google has a decent and formidable card to play there: It’s already incorporating Generative AI results into some of its search in addition to offering it in standalone apps. This gives it the option to offer it as a complement to its basic search experience — a better alternative than cannibalizing its own product. These are fascinating, mainly because they underscore just how much Google is used outside of the U.S. The top search term in 2024 was a soccer (football) tournament, the Copa América, followed by another soccer tournament, the UEFA European Championship. Those were followed by two cricket sporting events, the ICC Men’s T20 World Cup, and one specific “test match” between India and England. Overall, six of the top ten search trend terms were for sporting events (Olympics only made number 9). The top term in the list was for Liam Payne, the One Direction singer who died earlier this year, Donald Trump came in at number five. iPhone 16 and Catherine, Princess of Wales, round out the list. Searches (Global) Election insights Are Google searches a fascinating reflection of what is going on in the real world, or are they shaping what the real world ends up doing? Donald Trump, who won the U.S. presidential election, also topped his opponent Kamala Harris in Google searches. He appears in the top 10 global search trends (Harris does not); he was the No. 1 name on the global list of people search trends (Kamala was number three); and his gunshot incident even made it into the top 10 list for global news events. Trump outranked Harris similarly in U.S.-only trends. Top news trends In 2023, Google said that Israel/Gaza topped the news trends, and it’s telling that it didn’t continue to surge in 2024. Instead, this year the U.S. election topped the list for news events, alongside the Olympics, Rafah and Iran, and bizarrely, the Menendez brothers. Natural weather disasters continued to permeate the list, and the Crowdstrike outage was a big enough mess that it too broke into the top 10. Dubai chocolate bars Google may be wilfully ignoring search trends on social platforms in its rankings, but it can’t really avoid them. Dubai chocolate bars — a chocolate bar with a rich and crunchy pistachio-pastry filling — made it into multiple lists this year: Top global and U.S. food recipes and viral foods. But why? It comes down to TikTok: The bars became a sensation after a food influencer out of Dubai, where the bar first was produced, posted about it and her TikTok video went viral. That eventually bled into a million other media outlets writing about it, and voila: you have a Google search trend in the making. Nancy Meyers and her many guises Fashion inspiration, they say, can come from anywhere. In 2024, it came from middle-aged women in films. Filmmaker Nancy Meyers has been active since the early 1980s, but her real heyday was in the 1990s and early 2000s, when she turned folksy, sentimental, family-friendly comedy into box office gold — like the remake ofThe Parent Trap,Father of the Bride, andWhat Women Want. Many of her films feature iconic female characters who are well-off without being filthy rich, their position embodied in their relaxed fashion sense. Some of that has clearly started to speak to women in the 2020s. Behold the rise of Coastal Grandmother and her 2024 incarnation, the Coastal Granddaughter. Once again, thanks to prompts on social platforms like TikTok and Instagram, Meyers and Granddaughter both made it onto Google trending lists this year. Burnt toast and orange peels: No, these are not food trends People are somewhat obsessed with food, so it’s not a surprise that the top-two “internet theories” that trended in the U.S. in 2024 are references to eating. They are, in fact, totally unrelated otherwise. The burnt-toast theory is a modern-day, more optimistic version of what has been described variously as fatalism or determinism in philosophy: All the small things in life, including what appear to be setbacks, are all part of a bigger picture and happen for a reason. The orange peel theory is about how you can understand if someone is considerate of you: If you ask a person to peel an orange for you and they do, you’ve got a keeper. Or so the theory goes. Again, both of these got their viral starts on TikTok."
    },
    {
        "title": "Software testing platform LambdaTest secures $38M for AI push",
        "link": "https://techcrunch.com/2024/12/10/software-testing-platform-lambdatest-secures-38-million-in-ai-push/",
        "content": "LambdaTest, acloud-based software testing platform, has raised $38 million in a Series D funding round as it looks to expand its presence in existing markets and improve its AI capabilities. The Series D was led by Avataar Ventures, and saw participation from Qualcomm Ventures. It brings LambdaTest’s total funding raised to $108 million. LambdaTest provides infrastructure that lets companies test their applications across more than 5,000 browser and operating system combinations. Instead of setting up and maintaining expensive testing suites, companies can use LambdaTest’s cloud platform to see if their software runs as intended across different environments. LambdaTest also maintains labs with thousands of devices for testing. The investment comes as software testing faces mounting pressure from the rise of AI-generated code. According to LambdaTest’s survey of over 1,600 enterprise teams, only 23% of testing bandwidth is spent on test authoring and planning, and significant time is consumed by maintenance and operational tasks like fixing broken tests, triaging and debugging, and setting up test environments. The startup recently launched the KaneAI platform, which it describes as an “AI Native QA Agent-as-a-Service,” aiming to automate many such tedious testing tasks. The system, LambdaTest claims, can reduce manual effort in test script generation by 40%-70%. “KaneAI is more than a tool — it’s a transformative approach to QA, empowering teams to test smarter and faster, with less manual effort,” said Asad Khan, CEO and co-founder of LambdaTest. “Our foundation in LambdaTest’s cloud-based platform gives us an edge in delivering this solution at scale.” The company also claims its HyperExecute platform lets teams run tests up to 70% faster than traditional cloud grids, with 2.5x faster test resolution and 60% quicker error detection. The startup has also developed features like flaky test identification, which PWC reports helped reduce time spent on error reporting and analysis by 40%. Its test intelligence system offers auto error categorization and smart analytics, along with automatic retries of failed tests and reordering of tests for faster feedback, LambdaTest said. “As AI applications on the cloud and on devices become more prevalent, continuous testing with AI-driven automation is essential for accelerating release cycles and improving CI/CD pipeline efficiency,” said Quinn Li, Senior Vice President, Qualcomm and Global Head of Qualcomm Ventures. “LambdaTest’s comprehensive product suite is transforming software quality assurance with AI-driven autonomous testing systems. We are excited to support their journey.” The startup, which competes with firms like BrowserStack and SauceLabs, plans to deploy the fresh capital to make deeper inroads in its existing markets and broaden its technology stack. “Asad & team are a force of nature to be reckoned with — in a short period of time they have disrupted the entire market,” Nishant Rao, Avataar Ventures’ founding partner, said in a statement. “From creating the first AI-native, no-code QA solution to launching the only truly e2e Enterprise grade, secure test orchestration platform, they have totally changed the game.” LambdaTest, which counts Premji Invest, Peak XV Partners and Blume Ventures among its backers, says it serves over 15,000 customers, including Fortune 500 and G2000 enterprises across financial services, insurance, travel, retail and healthcare. Since its inception in 2017, users have executed more than 1.2 billion tests on the platform to date, the company said. Avendus advised LambdaTest for the new financing round."
    },
    {
        "title": "Hackers are exploiting a flaw in popular file-transfer tools to launch mass hacks, again",
        "link": "https://techcrunch.com/2024/12/10/hackers-are-exploiting-a-flaw-in-popular-file-transfer-tools-to-launch-mass-hacks-again/",
        "content": "Security researchers are warning that hackers are actively exploiting another high-risk vulnerability in a popular file transfer technology to launch mass hacks. The vulnerability, tracked as CVE-2024-50623, affects software developed by Illinois-based enterprise software company Cleo, according to researchers at cybersecurity company Huntress. The flaw was first disclosed by Cleo in asecurity advisoryon October 30 which warned that exploitation could lead to remote code execution. It affects ​​Cleo’s LexiCom, VLTransfer, and Harmony tools, which are commonly used by enterprises to manage file transfers. Cleo released a patch for the vulnerability in October, but ina blog on MondayHuntress warned that the patch does not mitigate the software flaw. Huntress security researcher John Hammond said the company has observed threat actors “exploiting this software en masse” since December 3. He added that Huntress — which protects more than 1,700 Cleo LexiCom, VLTransfer, and Harmony servers — has discovered at least 10 businesses whose servers were compromised. “Victim organizations so far have included various consumer product companies, logistics and shipping organizations, and food suppliers,” wrote Hammond, adding that many other customers are at risk of being hacked. Shodan, a search engine for publicly available devices and databases,listshundreds of vulnerable Cleo servers, the majority of which are located in the U.S. Cleo hasmore than 4,200 customers, including U.S. biotechnology company Illumina, sports footwear giant New Balance, and Dutch logistics firm Portable. Huntress has not yet identified the threat actor behind these attacks and it’s not known whether any data has been stolen from impacted Cleo customers. However, Hammond noted that the company has observed hackers performing “post-exploitation activity” after compromising vulnerable systems. Cleo did not respond to TechCrunch’s questions and has not yet released a patch that protects against the flaw. Huntress recommends that Cleo customers move any internet-exposed systems behind a firewall until a new patch is released. Enterprise file transfer tools are a popular target among hackers and extortion groups. Last year, the Russia-linked Clop ransomware gang claimed thousands of victims byexploiting a zero-day vulnerability in Progress Software’s MOVEit Transfer product. The same gang had previously taken credit for the mass exploitation ofa vulnerability in Fortra’s GoAnywhere managed file transfer software, which was used to target more than 130 organizations. "
    },
    {
        "title": "Aqemia raises $38M to find new drugs by meshing theoretical physics with GenAI",
        "link": "https://techcrunch.com/2024/12/10/aqemia-raises-38m-to-find-new-drugs-by-meshing-theoretical-physics-with-genai/",
        "content": "Aqemia, aFrench startupthat’s meshing “quantum-inspired physics” with machine learning to find new drugs, has raised $38 million in a fresh round of funding led bySan Francisco-based VC firm Cathay Innovation. This is Aqemia’s second fundraise of the year — itannounceda €30 million ($31.5 million) raise back in January — and it takes the company’s total funding raised past the $100 million mark. Founded in Paris by Maximilien Levesque and Emmanuelle Rolland-Martiano (pictured above) in 2019, Aqemia is one of countless startupsapplying AI to drug discovery. In 2024 alone, we’ve seen the likes ofHealx raise $47 millionto tackle rare diseases; Sam Altman-backed Formation Bioraise $372 million; and Xairaemerge from stealth with a whopping $1 billionin funding. Google DeepMind CEO Demis Hassabis and Director John Jumper, meanwhile,shared one-half of the Nobel Prizein chemistry for theirwork on Alphafold, an AI system that accurately predicts protein structures — vital for drug discovery. Aqemia, for its part, says it’s using physics and statistical mechanics algorithms to train a generative AI system, which then helps design potential drug candidates for “critical diseases.” The initial focus is on oncology (cancer) and immuno-oncology (using the body’s immune system to fight cancer). The company says this approach to training AI negates the need for experimental data, which is costly and time-consuming, and instead uses algorithms to essentially generate synthetic data to predict the properties of potential drug molecules and how they might interact with the target. It’s clear thatAI-enabled drug discoveryis a hot space right now, and Aqemia itself has already been making headway in industry. Last December, the startupsigneda multi-year agreement with French pharmaceutical giant Sanofi, a deal that could be worth up to $140 million depending on the outcome of certain R&D milestones. With a fresh $38 million in the bank, the company is now gearing up to bolster its recruitment efforts. That includes a new office in London that’s set to open in early 2025 — a move designed to give Aqemia “access to the UK’s rich talent pool,” according to apress release. Having a global VC firm like Cathay Innovation on board could also open the door to new markets. “Less than a year after our last round, this successful fundraising and the opening of our new London office mark significant strides toward our ambition to accelerate the discovery of new medicines on a global scale,” Levesque said in a statement. “Partnering with Cathay Innovation brings international expertise, particularly in the U.S. and Asia, reinforcing our vision and mission.” Aside from lead backer Cathay Innovation, Aqemia’s latest round saw participation from existing investors Wendel, Bpifrance Large Venture, Eurazeo, and Elaia."
    },
    {
        "title": "YouTube is testing multiplayer mini-games",
        "link": "https://techcrunch.com/2024/12/10/youtube-is-testing-multiplayer-mini-games/",
        "content": "YouTube is experimenting with multiplayer mini-games under its collection of lightweight, free games dubbed “Playables.” Currently, Ludo Club and Magic Tiles 3 support multiplayer mode. “We’re beginning to test a new multiplayer feature for a few select games on YouTube Playables. Multiplayer on Playables lets you play games in real-time with other users,” the companysaid. YouTube has beentesting mini-gamescalled“Playables”on its app and website for about a year now, and itopened up its free catalog of games to all usersthis May after restricting access to premium users. The video streaming service has steadily grown its portfolio for Playables. At the moment, you get more than 130 games across categories like Action, Arcade Brain & Puzzle, Trivia & Word, Racing, Simulation, and Sports. YouTube isn’t alone in using games to drive user engagement — several platforms, includingNetflix and LinkedIn, have added games to keep people using their platforms for more than watching movies or interacting with posts."
    }
]