{
    "techcrunch": [
        {
            "title": "AI boom masks fundraising struggles for non-AI startups",
            "link": "https://techcrunch.com/2024/12/17/ai-boom-masks-fundraising-struggles-for-non-ai-startups/",
            "content": "Earlier this year, IVP general partner Tom Loverroproclaimedthat the post-pandemic downturn is over, and companies that made it this far should prioritize growth over cost-cutting."
        },
        {
            "title": "Grammarly acquires productivity startup Coda, brings on new CEO",
            "link": "https://techcrunch.com/2024/12/17/grammarly-acquires-productivity-startup-coda-brings-on-new-ceo/",
            "content": "Grammarly is acquiring productivity startup Coda, the companyannouncedon Tuesday. As part of the deal, Coda’s CEO and co-founderShishir Mehrotrawill become the new CEO of Grammarly."
        },
        {
            "title": "Bob Lee verdict: Cash App creator’s killer found guilty of second-degree murder",
            "link": "https://techcrunch.com/2024/12/17/bob-lee-verdict-cash-app-creators-killer-found-guilty-of-second-degree-murder/",
            "content": "A San Francisco jury has found Nima Momeni guilty of second-degree murder in the stabbing of Bob Lee, the Cash App creator and former CTO of Block, according toNBC Bay Areaon Tuesday. The jury found Momeni not guilty of first-degree murder, meaning jurors decided the murder of Lee was not premeditated."
        },
        {
            "title": "This fintech processed $1B in payments through word-of-mouth",
            "link": "https://techcrunch.com/2024/12/17/this-fintech-processed-1b-in-payments-through-word-of-mouth/",
            "content": "Welcome to TechCrunch Fintech! This week, we’re diving into:"
        },
        {
            "title": "OpenAI says it has no plans for a Sora API — yet",
            "link": "https://techcrunch.com/2024/12/17/openai-says-it-has-no-plans-for-a-sora-api-yet/",
            "content": "OpenAI says it has no plans to release an API forSora, its AI model that can generate reasonably realistic videos when provided with a text description or reference image."
        }
    ],
    "wired": []
}